labs_oct/weather/WeatherServiceImplService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. -->
<definitions targetNamespace="http://service.weather.ws.bt.com/" name="WeatherServiceImplService" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:tns="http://service.weather.ws.bt.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <types>
    <xsd:schema>
      <xsd:import namespace="weather.ws.bt.com" schemaLocation="WeatherServiceImplService_schema1.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://service.weather.ws.bt.com/" schemaLocation="WeatherServiceImplService_schema2.xsd"/>
    </xsd:schema>
  </types>
  <message name="getWeather">
    <part name="parameters" element="tns:getWeather"/>
  </message>
  <message name="getWeatherResponse">
    <part name="parameters" element="tns:getWeatherResponse"/>
  </message>
  <portType name="WeatherService">
    <operation name="getWeather">
      <input wsam:Action="http://service.weather.ws.bt.com/WeatherService/getWeatherRequest" message="tns:getWeather"/>
      <output wsam:Action="http://service.weather.ws.bt.com/WeatherService/getWeatherResponse" message="tns:getWeatherResponse"/>
    </operation>
  </portType>
  <binding name="WeatherServiceImplPortBinding" type="tns:WeatherService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="getWeather">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="WeatherServiceImplService">
    <port name="WeatherServiceImplPort" binding="tns:WeatherServiceImplPortBinding">
      <soap:address location="REPLACE_WITH_ACTUAL_URL"/>
    </port>
  </service>
</definitions>

